{
  "//": "@see https://jsonresume.org/schema/",
  "basics": {
    "name": "Binliu ZHANG",
    "title": "Senior Frontend Engineer",
    "experience": "5+ years",
    "email": "i@zhangbinliu.me",
    "picture": "http://zhangbinliu.me/content/images/avatar_zbl.jpg",
    "phone": "(+86)185-0036-7879",
    "website": "http://zhangbinliu.me",
    "url": "http://zhangbinliu.me/resume",
    "summary": [
      "Self-driving front-end engineer with five years of experience in large-scale website development, proficient with JavaScript and web technologies, understanding Java, and skilled in using React eco-system tools to build high-performance front-end applications;",
      "Data-driven, with two years of data middle-platform experience, can find problems from data and solve them. And have an acquaintance with A/B testing(especially UI experiments) and growth hacking.",
      "Focus the Web trends, willingness to share, passion for exploring the best practices of front-end architecture, and practice new technologies to serve business and team."
    ],
    "location": "Beijing, CN",
    "social": [
      {
        "network": "LinkedIn",
        "username": "Zhang Binliu",
        "url": "https://www.linkedin.com/in/zhang-binliu-0722a48a"
      },
      {
        "network": "GitHub",
        "username": "@cool4zbl",
        "url": "https://github.com/@cool4zbl"
      },
      {
        "network": "Douban",
        "username": "郫县豆瓣",
        "url": "https://douban.com/people/cool4zbl"
      }
    ]
  },
  "skills": [
    {
      "name": "Technology",
      "keywords": [
        "HTML / CSS",
        "TypeScript / JavaScript",
        "React / Node.js / Front-end Engineering",
        "Java, C/C++ (Knowledge level)"
      ]
    },
    {
      "name": "Professional",
      "keywords": [
        "Passion & Responsible",
        "Quick learner & Problem Solver",
        "Sharing & Team Player"
      ]
    }
  ],
  "work": [
    {
      "company": "Ant Group",
      "website": "https://antgroup.com",
      "position": "Senior FrontEnd Engineer",
      "location": "Beijing",
      "time": "Jan 2018 ~ July 2020",
      "startDate": "2018.01",
      "endDate": "2020.07",
      "description": [
        "Responsible for the front-end development of \"Darwin\" -- an internal one-stop A/B testing platform for Ant Group",
        "Designed and carried out the front-end of Darwin A/B testing platform and runtime experiment SDK in an all-around way to fulfill the UI experiments' value, implemented and perfected the full-link front-end A/B Testing solution from 0 to 1",
        "Covered all scenarios of front-end experiments of Ant Group, helping businesses to use A/B testing adequately, and boosted data-driven business optimization and growth"
      ],
      "highlights": []
    },
    {
      "company": "Meituan",
      "position": "FrontEnd Engineer II",
      "website": "https://meituan.com",
      "location": "Beijing",
      "time": "Oct 2017 ~ Jan 2018",
      "startDate": "2017.10",
      "endDate": "2018.01",
      "description": [
        "Responsible for the development and maintenance of Map-Gaia front-end of Meituan's internal map data platform, and realized the functions of map data management, viewing/editing map POI data, etc., helping operations to edit better and maintain map data",
        "Accomplished the platform front-end business logic by using `Vue` + `Vuex` + `ElementUI`",
        "Implemented the map data-visualization: realized the function of displaying the map base layer and POI data by using Leaflet, achieved the customized map editing feature based on the custom development of `iD` editor"
      ],
      "highlights": ["Map", "Data Platform"]
    },
    {
      "company": "Douban",
      "position": "FrontEnd Engineer",
      "website": "https://meituan.com",
      "location": "Beijing",
      "time": "July 2015 ~ Sep 2017",
      "startDate": "2015.07",
      "endDate": "2017.09",
      "description": [
        "Responsible for the development and maintenance of PC & Mobile & Hybrid front-end pages of Douban, including Douban Movie, Douban Books, Douban Music, SNS, account system, etc. Implemented new features while continuously refactoring and optimizing, improved product iteration efficiency and user experience, and serving hundreds of millions of users",
        "Achieved the front-end development of the whole website account system (Mobile and Hybrid) by using `React`, integrated the Account system to Douban's multiple APP platforms(Douban APP & Read & Movie & FM) and were compatible with multi-version and multi-system"
      ],
      "highlights": []
    }
  ],
  "projects": [
    {
      "type": 0,
      "title": "Darwin \"Multi-terminal and Multi-domain\": Open A/B Testing middle-platform from 0 to 1",
      "time": "Jan 2018 ~ Apr 2020",
      "startDate": "2018.06",
      "endDate": "2020.04",
      "description": "Opened middle-platform to reduce the cost and lower the threshold of UI experiments.",
      "highlights": [
        "Cooperated with back-ends, through SaaS-based diversion service, designed and implemented Darwin A/B testing front-end runtime SDK: JS SDK & mini-program SDK & A/B component (including React, Vue, Alipay mini-program) & Egg plugin(Node.js), which closely followed the eco-system of Ant Group front-end apps and provided a unified and easy-use front-end A/B access solution",
        "JS SDK's main functions included A/B testing diversion parameters acquisition, A/B testing data collecting/logging, audience configuring, caching, etc. Analyzed logging data and refined the performance. In the end, SDK size was 43kB(8kB after gzip), and the success rate of getting parameters was 95%-99.9%, smoothing out various end differences; SDK had been downloaded above 20,000+ times, serving 10+ BUs, 1,000+ experiments, and had experienced tens of millions of traffic tests",
        "Led the cooperation between Darwin and various third-party platforms, like \"Darwin conjunction with Morpho (An internal page-building platform),\" and Alipay mini program IDE A/B testing extension, to help operations and developers respectively",
        "Integrated by the amount to 6+ business units, 30+ internal platform products, and empowered AB Testing ability in the business",
        "**Tech Stack**: `TypeScript` + `React` + `Lerna` + `Webpack` + `Jest` + `Node.js`"
      ],
      "url": ""
    },
    {
      "type": 0,
      "title": "Darwin: Platform construction from 1 to 10",
      "time": "Jan 2018 ~ Apr 2020",
      "startDate": "2018.01",
      "endDate": "2020.04",
      "description": "Developed the platform of scientific authority by building various A/B testing capabilities.",
      "highlights": [
        "Built the one-stop A/B testing platform Darwin as a front-end core developer with PMs, UI designers, back-ends, and data scientists(30 colleagues in total)",
        "Landed and improved various basic and high-level A/B testing capabilities, such as the life cycle of A/B tests, metric system productization, automatic decision-making, real-time monitoring, multi-dimensional analysis, and dashboard, etc., helping the platform to realize the construction of scientific authority platform from 1 to 10",
        "Carried out code clean continuously and had unified the tech stack, solved heavy historical burden and chaotic architecture, and abstracted the domain model layer. Packaged some fundamental or data visualization components based on Ant Design and Ant Vision",
        "Established the quality assurance system (front-end monitoring, promotion of TypeScript, etc.), which resulted in improving R&D efficiency by 30%",
        "Surveyed 5+ famous A/B testing platforms, explored and enhanced some useful features with designers, made the platform easy to use and gained a good user reputation",
        "**Tech Stack**: `TypeScript` + `React` + `AntDesign` + `AntVision`"
      ],
      "url": ""
    },
    {
      "type": 1,
      "title": "re-Resume 2.0",
      "time": "Aug 2020 ~ Oct 2020",
      "startDate": "2020.08",
      "endDate": "2020.10",
      "description": "Yet another responsive resume template-builder with good typography and design sense.",
      "highlights": [
        "Concise, simple, and configurable, without excessive dependence",
        "Intl supported with SEO optimization",
        "**Tech Stack**: `TypeScript` + `React` + `Puppeteer`"
      ],
      "url": "http://zhangbinliu.me/resume",
      "github": "https://github.com/cool4zbl/resume"
    }
  ],
  "education": [
    {
      "institution": "University of Electronic Science and Technology of China (UESTC)",
      "website": "https://www.uestc.edu.cn",
      "area": "Electronic Engineering",
      "studyType": "BSc",
      "startDate": "2011.09.01",
      "endDate": "2015.07.01",
      "gpa": "3.6",
      "courses": [
        "Analogue Circuit",
        "Digital Circuit",
        "Princlple of Computer",
        "Signal and System",
        "Information Theory"
      ]
    }
  ],
  "languages": [
    {
      "language": "Chinese",
      "fluency": "Native"
    },
    {
      "language": "English",
      "fluency": "Working knowledge"
    }
  ],
  "interests": [
    {
      "name": "Wildlife",
      "keywords": ["Ferrets", "Unicorns"]
    }
  ],
  "prototype": [
    {
      "name": "Hobbies",
      "description": [
        "A lifelong learner, always keeping curious about the world",
        "Tool enthusiast / Productivity-driven / Vimer",
        "Obsessed with all aesthetic designs",
        "Reading / Photography / Music / Fitness",
        "Life tenet: Work hard, play hard."
      ]
    },
    {
      "name": "Quotes",
      "description": [
        "Fake it till you make it.",
        "God helps one who help themselves"
      ]
    }
  ],
  "thanks": [
    "I cherish every opportunity to make me better and look forward to working with you. Thank you for your precious time, and wish you success in your work."
  ]
}
